// строка с кабиком Ferris
const FERRIS: &str = r#"
    _~^~^~_
\) /  o o  \ (/
  '_   -   _'
  / '-----' \
"#;

fn main() {
    // с помощью последовательностей ANSI
    // очистите экран терминала и сделайте курсор невидимым

    loop {
        // выведите время в формате `часы-мин-сек` (цвет blue)
        // и крабика Ferris (цвет yellow)

        // после кужно переместить курсор вверх не несколько строк
        // для новой итерации

        // подумайте, как часто вы хотите обновлять время
    }
}
